package org.example.hw.block1_5_methods.task6;

/*
1.5.6 Студент отличник. Измените сущность Студент из задачи 1.4.7. Новые требования включают:
    • Студент может возвращать значение своей средней оценки (вещественное число). Если оценок нет, то среднее – 0.
    • Студент может возвращать информацию о том, является ли он отличником или нет (только true или false). Студент является отличником если у него есть хотя бы одна оценка и все оценки только отличные.
Необходимо выполнить следующие задачи:
    1. Создайте студента Васю с оценками 3,4,5,4
    2. Создайте студента Петю с оценками 5,5,5,5
    3. Выведите для обоих студентов информацию о среднем балле и являются ли они отличниками
 */
public class ExcellentStudent {
}
