package org.example.hw.block1_5_methods.task4;


/*
1.5.4. Отец моего отца. Измените сущность Человек из задачи 1.4.6. Добавьте
Человеку следующие возможности:
    • Может возвращать Личное имя.
    • Может возвращать Отчество
    • Может возвращать Фамилию. Если Фамилия задана у текущего объекта,
    то возвращается она, иначе необходимо найти ближайшего (по ветке наследования) родителя
    у которого Фамилия задана и вернуть её
Измените метод приведения Человека к строковой форме так, чтобы значение фамилии выбиралось с использованием указанного выше поведения.
 */
public class MyFathersFather {
}
